// Программа "Шифратор"
// Гурова О.В.

#include <windows.h> 
#include <iostream> 
#include <string.h> 

using namespace std;

int a, i;
char stroka[2];
char c;
char text[256];
char alf[] = { 'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ь','Ы','Ъ','Э','Ю','Я',
'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ь','ы','ъ','э','ю','я',' ' };
char key[] = { 'Я','Ъ','Ю','Э','Й','Ь','Д','Ш','О','Ц','Х','Г','У','Б','С','Р','А','К','Ж','М','Щ','Ч','Ы','И','З','Н','Ё','Е','Л','Ф','В','Т','П',
'я','ъ','ю','э','й','ь','д','ш','о','ц','х','г','у','б','с','р','а','к','ж','м','щ','ч','ы','и','з','н','ё','е','л','ф','в','т','п',' ' };

void vivod()
{
    cout << "\n                МОНОАЛФАВИТНЫЙ ШИФР (ШИФР ПРОСТОЙ ЗАМЕНЫ) \n";
    cout << "\n    Программа студента группы БББО-05-20 ";
    cout << "\n    Гуровой О.В.\n\n";

    cout << "\n                            Таблицы-шифровки\n";
    cout << "\n  ---------------------------------------------------------------------\n";
    cout << "  | ";
    for (i = 0; i < 33; i++)
    {
        cout << alf[i];
        cout << " ";
    };
    cout << "|";
    cout << "\n  ---------------------------------------------------------------------\n";
    cout << "  | ";
    for (i = 0; i < 33; i++)
    {
        cout << key[i];
        cout << " ";
    };
    cout << "|";
    cout << "\n  ---------------------------------------------------------------------\n";


    cout << "\n  ---------------------------------------------------------------------\n";
    cout << "  | ";
    for (i = 33; i < 66; i++)
    {
        cout << alf[i];
        cout << " ";
    };
    cout << "|";
    cout << "\n  ---------------------------------------------------------------------\n";
    cout << "  | ";
    for (i = 33; i < 66; i++)
    {
        cout << key[i];
        cout << " ";
    };
    cout << "|";
    cout << "\n  ---------------------------------------------------------------------\n";
};

void cin_cl()
{
    cin.seekg(0, ios::end);
    cin.clear();
};

void vvod()
{
    cout << "\n Введите сообщение, вы можете использовать русский алфавит (заглавные и строчные буквы), а также"
        " знаки препинания для удобства чтения, которые не шифруются программой (. , () : ! ?):\n";
    cout << "  ";
    gets_s(text);
    cin_cl();

    for (i = 0; i < strlen(text); i++)
    {
        if (!((text[i] >= 'А') && (text[i] <= 'я') || (text[i] == '.') || (text[i] == ',') || (text[i] == '!') ||
            (text[i] == '?') || (text[i] == '(') || (text[i] == ')') || (text[i] == ':') || (text[i] == ' ')))
        {
            cout << "\n   !!! ОШИБКА: Некорректно введено сообщение. Повторите попытку. !!!\n";
            for (a = 0; a < 256; a++)
                text[a] = 0;
            break;
        }
    };
};

void shifr()
{
    for (a = 0;a < strlen(text);a++)
    {
        for (i = 0; i < strlen(alf); ++i)
        {
            if (text[a] == alf[i])
            {
                text[a] = key[i];
                break;
            };
        };
    };
    cout << "\n Зашифрованное сообщение:\n";
    cout << "  ";
    cout << text;
};

void deshifr()
{
    for (a = 0; a < strlen(text); a++)
    {
        for (i = 0; i < strlen(key); ++i)
        {
            if (text[a] == key[i])
            {
                text[a] = alf[i];
                break;
            };
        };
    };
    cout << "\n Дешифрованное сообщение:\n";
    cout << "  ";
    cout << text;
};




int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    vivod();


    for (;;)
    {
        cout << "\n\n Выберите действие:\n  1 - Ввести сообщение\n  2 - Зашифровать сообщение\n"
            "  3 - Дешифровать сообщение\n  4 - Завершить работу программы\n Выбранное действие: ";
        cin >> stroka;
        cin_cl();

        if (strlen(stroka) == 1)
        {
            c = stroka[0];

            if (c == '4')
                break;

            if ((c != '1') && (c != '2') && (c != '3') && (c != '4'))
            {
                cout << "\n   !!! ОШИБКА: Некорректно введено дейcтвие. Повторите попытку. !!!\n";
            }
            else if ((text[0] == 0) && ((c == '2') || (c == '3')))
            {
                cout << "\n   !!! ОШИБКА: Пользователь не ввел сообщение. "
                    "Сначала нажмите '1', чтобы ввести сообщение. !!!\n";
            }
            else
            {
                switch (c)
                {
                case '1': {vvod(); break;}
                case '2': {shifr(); break;}
                case '3': {deshifr(); break;}
                };
            };
        }
        else
            cout << "\n   !!! ОШИБКА: Некорректно введено дейcтвие. Повторите попытку. !!!\n";
    };

    cout << "\n                    Программа завершила свою работу.\n";
    cout << "\n                Спасибо, что использовали этот шифратор!\n";

    return 0;

};
